In [83]:
import pandas as pd
import numpy as np

Cargamos el csv entero y miramos las 10 primeras filas para saber con que vamos a trabajar

In [84]:
titanic = pd.read_csv("titanic3.csv")
titanic.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [85]:
print("El tamaño del dataframe es de",titanic.shape[0],"filas y",titanic.shape[1],"columnas.")

El tamaño del dataframe es de 1309 filas y 14 columnas.

In [86]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [87]:
titanic.dtypes

Dropeamos las columnas que nos nos interesan

In [88]:
titanic2 = titanic.drop(['name','sibsp','parch','ticket','cabin','body','boat','home.dest'], axis=1)

Vamos a mirar que cantidad de valores nulos hay por columnas y ver como los podemos rellenar

In [89]:
titanic2.isnull().sum()

La edad la podemos rellenar con la media por clase, los que faltan de fare y embarked como son pocos no los tocamos y el barco no hace falta tocarlos porque los que no llegaron en barco murieron

In [90]:
titanic2["pclass"].unique()

In [91]:
clase1 = titanic2[(titanic2['pclass']==1)]
print("La media de edad de la clase 1 es",clase1['age'].dropna().mean())

La media de edad de la clase 1 es 39.15991795774648

In [92]:
clase2 = titanic2[(titanic2['pclass']==2)]
print("La media de edad de la clase 2 es",clase2['age'].dropna().mean())

La media de edad de la clase 2 es 29.506704980842912

In [93]:
clase3 = titanic2[(titanic2['pclass']==3)]
print("La media de edad de la clase 3 es",clase3['age'].dropna().mean())

La media de edad de la clase 3 es 24.81636726546906

Podemos observar que cuanto menor es la clase menor es la media de edad

In [94]:
titanic2["age"][(titanic2["pclass"] == 1) & (titanic2["age"].isna())] = clase1['age'].dropna().mean()
titanic2["age"][(titanic2["pclass"] == 2) & (titanic2["age"].isna())] = clase2['age'].dropna().mean()
titanic2["age"][(titanic2["pclass"] == 3) & (titanic2["age"].isna())] = clase3['age'].dropna().mean()

<ipython-input-94-f97ba20d1565>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic2["age"][(titanic2["pclass"] == 1) & (titanic2["age"].isna())] = clase1['age'].dropna().mean()
<ipython-input-94-f97ba20d1565>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic2["age"][(titanic2["pclass"] == 2) & (titanic2["age"].isna())] = clase2['age'].dropna().mean()
<ipython-input-94-f97ba20d1565>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic2["age"][(titanic2["pclass"] == 3) & (titanic2["age"].isna())] = clase3['age'].dropna().mean()

Rellenamos fare con la media y embarked con S que es la más común

In [95]:
titanic2["fare"][(titanic2["fare"].isna())] = titanic2['fare'].dropna().mean()
titanic2["embarked"][(titanic2["embarked"].isna())] = 'S'

<ipython-input-95-772adadb67c4>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic2["fare"][(titanic2["fare"].isna())] = titanic2['fare'].dropna().mean()
<ipython-input-95-772adadb67c4>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic2["embarked"][(titanic2["embarked"].isna())] = 'S'

Comprobamos si queda algún nulo

In [96]:
titanic2.isnull().sum()

In [97]:
titanic2

,pclass,survived,sex,age,fare,embarked
0,1,1,female,29.000000,211.3375,S
1,1,1,male,0.916700,151.5500,S
2,1,0,female,2.000000,151.5500,S
3,1,0,male,30.000000,151.5500,S
4,1,0,female,25.000000,151.5500,S
...,...,...,...,...,...,...
1304,3,0,female,14.500000,14.4542,C
1305,3,0,female,24.816367,14.4542,C
1306,3,0,male,26.500000,7.2250,C
1307,3,0,male,27.000000,7.2250,C
1308,3,0,male,29.000000,7.8750,S

In [98]:
dummy_sex = pd.get_dummies(titanic2["sex"], prefix = "sex").iloc[:,1:]
dummy_sex.head()

,sex_male
0,0
1,1
2,0
3,1
4,0

In [99]:
dummy_embarked = pd.get_dummies(titanic2["embarked"], prefix = "embarked").iloc[:,1:]
dummy_embarked.head()

,embarked_Q,embarked_S
0,0,1
1,0,1
2,0,1
3,0,1
4,0,1

In [100]:
column_names = titanic2.columns.values.tolist()
titanic3 = titanic2[column_names].join(dummy_sex)
titanic3.head()

,pclass,survived,sex,age,fare,embarked,sex_male
0,1,1,female,29.0000,211.3375,S,0
1,1,1,male,0.9167,151.5500,S,1
2,1,0,female,2.0000,151.5500,S,0
3,1,0,male,30.0000,151.5500,S,1
4,1,0,female,25.0000,151.5500,S,0

In [101]:
column_names = titanic3.columns.values.tolist()
titanic4 = titanic3[column_names].join(dummy_embarked)
titanic4.head()

,pclass,survived,sex,age,fare,embarked,sex_male,embarked_Q,embarked_S
0,1,1,female,29.0000,211.3375,S,0,0,1
1,1,1,male,0.9167,151.5500,S,1,0,1
2,1,0,female,2.0000,151.5500,S,0,0,1
3,1,0,male,30.0000,151.5500,S,1,0,1
4,1,0,female,25.0000,151.5500,S,0,0,1

In [102]:
feature_cols = ["pclass", "age","fare","sex_male","embarked_Q","embarked_S"]
X = titanic4[feature_cols]
Y = titanic4["survived"]

In [103]:
from sklearn.model_selection import train_test_split

X_train, X_test, Y_train, Y_test = train_test_split(X,Y, test_size = 0.2, random_state = 0)

In [104]:
from sklearn import linear_model
logit_model = linear_model.LogisticRegression()
logit_model.fit(X_train,Y_train)

LogisticRegression()

In [105]:
logit_model.score(X_train,Y_train)

0.7793696275071633

In [106]:
1-Y_train.mean()

0.6179560649474689

In [107]:
pd.DataFrame(list(zip(X_train.columns, np.transpose(logit_model.coef_))))

,0,1
0,pclass,[-1.0059352320512835]
1,age,[-0.0263499276976711]
2,fare,[-0.0007597746084836678]
3,sex_male,[-2.423499368041728]
4,embarked_Q,[-0.4112700235093858]
5,embarked_S,[-0.636834799086491]

In [108]:
from sklearn import metrics

In [109]:
prediction = logit_model.predict(X_test)
prediction

In [110]:
metrics.accuracy_score(Y_test, prediction)

0.7900763358778626